app/controllers/gatherings_controller.rb

SELECT `gatherings`.* FROM `gatherings` ORDER BY name ASC
---
  def index
    @gathering = Gathering.order("name ASC")

INSERT INTO `gatherings` (`ante_date`, `ante_time`, `created_at`, `description`, `event_date`, `event_time`, `gathering_type`, `location`, `max_attendees`, `min_attendees`, `name`, `updated_at`) VALUES ('2014-12-31', '2000-01-01 12:59:00', '2014-03-02 20:39:21', 'yes', '2014-12-31', '2000-01-01 12:59:00', 'yup', 'huh?', 1, 2, 'Test', '2014-03-02 20:39:21')
---
  def create
    @gathering = Gathering.new(gathering_params)
    if @gathering.save