app/controllers/users_controller.rb

  def index
  	@users = User.order("first_name ASC")
---
SELECT `users`.* FROM `users` ORDER BY first_name ASC